tap "homebrew/bundle"
tap "homebrew/core"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# Console Matrix
brew "cmatrix"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# File format designed to store large amounts of data
brew "hdf5"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Implementation of the MPI Message Passing Interface standard
brew "mpich"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node", link: false
# Platform built on V8 to build network applications
brew "node@18"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# BBS client
cask "welly"
